import colors from "../../values/colors";

export const HelpInformation = () => {
    return (
        <div style={{
            height: "90%", width: "93%", backgroundColor: colors.pearl,
            borderWidth: '5px', borderColor: colors.blood, borderRadius: '5px', overflowY: 'auto',
            display: 'flex', flexDirection: 'column', padding: '10px'
        }}>
            <p className={"help-title"}>სისხლის მოთხოვნა</p>
            <p className={"help-text"}>დარწმუნდით, რომ შემოსული ხართ როგორც მომხმარებელი, "მჭირდება სისხლი"-ს
                ღილაკზე დაჭერით გადადით მოთხოვნის გვერდზე და შეავსეთ ინფორმაცია.</p>
            <p className={"help-text"}>გთხოვთ მას შემდეგ რაც თქვენი მოთხოვნა დაკმაყოფილდება ან სხვა მიზეზით ისურვებთ
                მის გაუქმებას, გადადით თქვენი მოთხოვნის გვერდზე და წაშალეთ ან დაადასტურეთ. დადასტურების შემთხვევაში,
                დადასტურებამდე მონიშნეთ ის ადამიანები ვინც სისხლი გასცეს.</p>
            <p className={"help-title"}>სისხლის გაცემა</p>
            <p className={"help-text"}>იმისთვის რომ მეილზე შეტყობინებები მიიღოთ სისხლზე ძებნის გამოცხადებისას,
                საჭიროა, რომ დონორად მოინიშნოთ თავი პროფილის გვერდზე.</p>
            <p className={"help-text"}>გვერდი არ აკონტროლებს თქვენს დონორობასთან თავსებადობას, თქვენი ვალდებულებაა
                დონორად არ გქონდეთ თავი მონიშნული თუკი მიგაჩნიათ, რომ დონორად რაიმე მიზეზის გამო ვერ გამოდგებით.</p>
            <p className={"help-text"}>მეტი სანდოობისთვის, საშუალება გაქვთ ატვირთოთ ნებისმიერი სახის სამედიცინო
                დოკუმენტები პროფილის გვერდზე, თუმცა სავალდებულო არ არის.</p>
            <p className={"help-title"}>დონაციის წესები</p>
            <p className={"help-text"}>(წესები დაფუძნებულია bloodbank.ge-ს მოთხოვნებზე 20/07/2024-ის მონაცემებით.)</p>
            <p className={"help-text"}>თქვენი ასაკი უნდა იყოს 18-60 წლის ფარგლებში.</p>
            <p className={"help-text"}>უნდა იწონიდეთ 55 კგ-ზე მეტს.</p>
            <p className={"help-text"}>თქვენი ჰემოგლობინი უნდა იყოს ნორმის ფარგლებში.</p>
            <p className={"help-text"}>არ უნდა იყოთ სისხლის გზით გადამდები დაავადებ(ებ)ით დაავადებული.</p>
            <p className={"help-text"}>გასულ კვირას არ უნდა გქონდეთ გადატანილი მაღალი ტემპერატურა.</p>
            <p className={"help-text"}>არ უნდა მკურნალობდეთ ანტიბიოტიკით ან სხვა ზოგიერთი მედიკამენტით.</p>
            <p className={"help-text"}>არ უნდა გქონდეთ გულსისხლძარღთვა დაავადება, ეპილეფსია, დიაბეტი.</p>
            <p className={"help-text"}>არ უნდა გქონდეთ ღვიძლის ან თირკმლის ქრონიკული დაავადება.</p>
            <p className={"help-text"}>არ უნდა გქონდეთ სქესობრივი გზით გადამდები დაავადება.</p>
            <p className={"help-text"}>უკანასკნელი დონაციისას არ უნდა დაგეკარგათ გონება.</p>
            <p className={"help-text"}>უახლოეს წარსულში არ უნდა იყოთ სისხლის პროდუქტებით ნამკურნალები.</p>
            <p className={"help-text"}>დონაცია არ შეიძლება თუ მოიხმარდით ნარკოტიკს ან იყენებდით საერთო შპრიცს.</p>
            <p className={"help-text"}>უკანასკნელი სტომატოლოგთან ვიზიტიდან გასული უნდა იყოს 2-3 თვე.</p>
            <p className={"help-text"}>ტატუს გაკეთებიდან გასული უნდა იყოს ერთი წელი.</p>
            <p className={"help-text"}>სისხლის გაცემა აკრძალულია თუ ხართ ორსული ან მეძუძური დედა.</p>
            <p className={"help-text"}>ბოლო ერთი წლის განმავლობაში არ უნდა გქონდეთ გაკეთებული ქირურგიული ოპერაცია.</p>
            <p className={"help-text"}>არ უნდა გქონდეთ მენსტრუალური ციკლი.</p>
            <p className={"help-text"}>არ უნდა იყოთ აცრილი ბოლო ორი თვის განმავლობაში.</p>
            <p className={"help-text"}>ბოლო 24 საათის განმავლობაში ალკოჰოლი არ უნდა გქონდეთ მიღებული.</p>
            <p className={"help-text"}>განმეორებითი დონაცია შესაძლებელია დონაციიდან ორი თვის შემდეგ.</p>
        </div>
    );
}